# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# 'revcol_tiny', 'revcol_small', 'revcol_base', 'revcol_large', 'revcol_xlarge'
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, revcol_tiny, []]  # 4 0-4 P1=None P2 P3 P4 P5
  - [-1, 1, SPPF, [1024, 5]]  # 5


# YOLOv8.0n head
head:
  - [-1, 1, Conv, [256, 1, 1]]  # 6, Y5, lateral_convs.0
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]

  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]  # 10, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [256]]  # X3 (15), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]  # 220, downsample_convs.0
  - [[-1, 11], 1, Concat, [1]]  # cat Y4
  - [-1, 3, C2f, [256]]  # F4 (18), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]  # 17, downsample_convs.1
  - [[-1, 6], 1, Concat, [1]]  # cat Y5
  - [-1, 3, C2f, [256]]  # F5 (21), pan_blocks.1

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)